In [1]:
# Add the Pandas dependency

import pandas as pd

In [2]:
# Files to load

school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [3]:
# Read the school data file and store it in a Pandas DateFrame

school_data_df = pd.read_csv(school_data_to_load)

school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
# Read the student data file and store it in a Pandas DataFrame

student_data_df = pd.read_csv(student_data_to_load)

student_data_df.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [5]:
# Determine if there are any missing values in the school data

school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [6]:
# Determine if there are any missing values in the student data

student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [7]:
# Determine if there are any missing values in the school data

school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [8]:
# Determine if there are any missing values in the student data

student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [9]:
# Determine if there are not any missing values in the school data

school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [10]:
# Determine if there are any missing values in the school data

school_data_df.notnull().sum()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [11]:
# Determine data types for the school DataFrame

school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [12]:
# Determine data types for the student DataFrame

student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [13]:
# Add each prefix and suffix to remove to a list

prefixes_suffixes = ["Dr. ", "Mr. ", "Ms. ", "Mrs ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [14]:
# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, ""

for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word, "", regex=True)
    
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [15]:
# Combine the data into a single dataset


school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [16]:
# Get the total number of students
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [17]:
# Calculate the total number of schools, option 1
school_count = school_data_df["school_name"].count()
school_count

15

In [18]:
# Calculate the total number of schools, option 2

school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2
len(school_count_2)

15

In [19]:
# Calculate the Total Budget

total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [20]:
# Calculate the average reading score

avg_reading_score = school_data_complete_df["reading_score"].mean()
avg_reading_score

81.87784018381414

In [21]:
# Calculate the average math score

avg_math_score = school_data_complete_df["math_score"].mean()
avg_math_score

78.98537145774827

In [22]:
passing_math = school_data_complete_df["math_score"] >= 70
passing_reading = school_data_complete_df["reading_score"] >= 70

# creates Series of bool values True where m_s >= 70, False otherwise

In [23]:
passing_math.count()
# counts where True (so it seems)

39170

In [24]:
# Get all the students who are passing math/reading in a new DataFrame
# Filters for True values, add previous exp in brackets around complete_df
passing_math_df = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_reading_df = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]

# creates new dfs where conditions are true

In [25]:
# Calculate the number of students passing math

passing_math_count = passing_math_df["student_name"].count()

# Calculat ethe number of students passing reading

passing_reading_count = passing_reading_df["student_name"].count()

In [26]:
print(passing_math_count)
print(passing_reading_count)

29370
33610

In [27]:
# Get the total number of students again: school_data_complete_df["Student ID"].count() -OG merge

student_count

39170

In [28]:
# Calculate the percent that passed math

passing_math_percent = passing_math_count / student_count * 100

# Calculate the percent that passed reading

passing_reading_percent = passing_reading_count / student_count * 100

# note: (may have to wrap counts in float() for other versions of python)

In [29]:
# print both

print(passing_math_percent)
print(passing_reading_percent)

74.9808526933878
85.80546336482001

In [30]:
# Calculate the students who passed both math and reading
# filter for >= 70 like above but for both columns using and (&) operator - must use &, not "and"

passing_math_reading_df = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [31]:
# Count number of students after filtered scores
passing_math_reading_count = passing_math_reading_df.student_name.count()

print(passing_math_reading_count)

25528

In [32]:
# Calc percentage of passing both
passing_math_reading_percent = passing_math_reading_count / student_count * 100

print(passing_math_reading_percent)

65.17232575950983

In [33]:
# Needed in District Summary DataFrame:
    # Total number of schools in the column "Total Schools"
    # Total number of students in the column "Total Students"
    # Total budget in the column "Total Budget"
    # Average reading score in the column "Average Reading Score"
    # Average math score in the column "Average Math Score"
    # Percentage of students passing reading in the column "% Passing Reading"
    # Percentage of students passing math in the column "% Passing Math"
    # Overall passing percentage in the column "% Overall Passing"
    
# Create a district_summary_df

In [34]:
# Adding a list of values with keys to create a new DataFrame

district_summary_df = pd.DataFrame(
    [{"Total Schools": school_count,
     "Total Students": student_count,
     "Total Budget": total_budget,
     "Average Math Score": avg_math_score,
     "Average Reading Score": avg_reading_score,
     "% Passing Math": passing_math_percent,
     "% Passing Reading": passing_reading_percent,
     "% Overall Passing": passing_math_reading_percent}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [35]:
# Format the "Total Students" to have the comma for a thousands separator
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [36]:
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$"

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [37]:
# Need to format the remaining columns accordingly:

    # The "Average Reading Score" column will be formatted to one decimal place.
    # The "Average Math Score" column will be formatted to one decimal place.
    # The "% Passing Reading" column will be formatted to the nearest whole number percentage.
    # The "% Passing Math" column will be formatted to the nearest whole number percentage
    # The "% Overall Passing" column will be formatted to the nearest whole number percentage.

In [38]:
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)
district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [39]:
# Reorder the columns in the order you want them to appear
new_column_order = ["Total Schools", "Total Students", "Total Budget", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65